In [68]:
import pandas as pd

In [80]:
csv_files = {
    'contact_df':['contact_df_raw','C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\contact.csv','contact_id'],
    'customer_df':['customer_df_raw','C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\customer.csv','customer_id'],
    'product_df':['product_df_raw','C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\product.csv','ticker'],
    'txn_df':['txn_df_raw','C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\txn.csv','txn_id'],
    'state_df':['state_df_raw','C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\state.csv','state_code'],
    'touch_df':['touch_df_raw','C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\touch.csv','txn_id']
}
raw_df = {}

In [70]:
def load_data(file_name):
    df = pd.read_csv(file_name)
    return df

In [71]:
def set_key(df, index):
    df_indexed = df.set_index(index)
    return df_indexed

In [78]:
for key, value in csv_files.items(): 
    value[0] = load_data(value[1])
    raw_df[value[2]] = [value[0], key]

In [79]:
for key, value in raw_df.items(): 
    value[1] = set_key(value[0],key)
    
    print(type(value[1]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [84]:
customer_df.head()

                                    customer_name                   category
customer_id
450056063           B.W.E CUSTOM CONSTRUCTION LLC          Insurance Company
450056064    SERGEY NIZHEGORODTSEV PUBLISHING LLC           Regional Company
450056066                     SUNRISE ANDOVER LLC                Independent
450056067               474 CENTRAL BOULEVARD LLC                       Bank
450056068                      ELITE FINISHES LLC  Trading Platform Provider

In [83]:
contact_df_raw = load_data(contact_file)
contact_df_raw.head()

,contact_id,first_name,last_name,city,state_code,zip,country,latitude,longitude,customer_id,status,opportunity
0,100000339,Lyndy,Chachas,Omaha,NE,68130,USA,41.22962,-96.18150,450058148,Active,50000
1,100001423,Watts,Eifenstadt,Weston,FL,33326,USA,26.09966,-80.36497,450059017,Active,50000
2,100001837,Jingfeng,Lopina,Hunt Valley,MD,21030,USA,39.50004,-76.66566,450059076,Active,125000
3,100002544,Gaynell,Vivrett,Beloit,WI,53511,USA,42.49625,-89.03702,450057762,Active,16000
4,100002551,Peregrino,Valles,New York,NY,10036,USA,40.75841,-73.98155,450055995,Active,150000

In [39]:
contact_df = set_key(contact_df_raw,'contact_id')

contact_df.head()

,first_name,last_name,city,state_code,zip,country,latitude,longitude,customer_id,status,opportunity
contact_id,,,,,,,,,,,
100000339,Lyndy,Chachas,Omaha,NE,68130,USA,41.22962,-96.18150,450058148,Active,50000
100001423,Watts,Eifenstadt,Weston,FL,33326,USA,26.09966,-80.36497,450059017,Active,50000
100001837,Jingfeng,Lopina,Hunt Valley,MD,21030,USA,39.50004,-76.66566,450059076,Active,125000
100002544,Gaynell,Vivrett,Beloit,WI,53511,USA,42.49625,-89.03702,450057762,Active,16000
100002551,Peregrino,Valles,New York,NY,10036,USA,40.75841,-73.98155,450055995,Active,150000

In [33]:
#set_key()
contact_df_raw.head()

,first_name,last_name,city,state_code,zip,country,latitude,longitude,customer_id,status,opportunity
contact_id,,,,,,,,,,,
100000339,Lyndy,Chachas,Omaha,NE,68130,USA,41.22962,-96.18150,450058148,Active,50000
100001423,Watts,Eifenstadt,Weston,FL,33326,USA,26.09966,-80.36497,450059017,Active,50000
100001837,Jingfeng,Lopina,Hunt Valley,MD,21030,USA,39.50004,-76.66566,450059076,Active,125000
100002544,Gaynell,Vivrett,Beloit,WI,53511,USA,42.49625,-89.03702,450057762,Active,16000
100002551,Peregrino,Valles,New York,NY,10036,USA,40.75841,-73.98155,450055995,Active,150000

In [3]:
# Reads contents of a CSV file into a Pandas dataframe
# Any operation on a dataframe results in another dataframe
#contact_df = pd.read_csv('C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\contact.csv')

# Print the type of a dataframe
# type(contact_df)
# type(contact_df.head(10))

# To get the top 10 rows of a df
# To store the resulting df, assign it to a variable
top10_contact_df=contact_df.head(10)
top10_contact_df.head()

# To get the bottom 10 rows
# contact_df.tail(10)

# Make a copy of a df
copy_contact_df=contact_df
copy_contact_df

,contact_id,first_name,last_name,city,state_code,zip,country,latitude,longitude,customer_id,status,opportunity
0,100000339,Lyndy,Chachas,Omaha,NE,68130,USA,41.22962,-96.18150,450058148,Active,50000
1,100001423,Watts,Eifenstadt,Weston,FL,33326,USA,26.09966,-80.36497,450059017,Active,50000
2,100001837,Jingfeng,Lopina,Hunt Valley,MD,21030,USA,39.50004,-76.66566,450059076,Active,125000
3,100002544,Gaynell,Vivrett,Beloit,WI,53511,USA,42.49625,-89.03702,450057762,Active,16000
4,100002551,Peregrino,Valles,New York,NY,10036,USA,40.75841,-73.98155,450055995,Active,150000
...,...,...,...,...,...,...,...,...,...,...,...,...
209997,999952205,Zan,Lackritz-carroll,Ridgeland,MS,39157,USA,32.43737,-90.14739,450056488,Active,50000
209998,999973035,Ninh,Longphee,Tulsa,OK,74134,USA,36.08847,-95.83001,450058801,Active,17000
209999,999984817,Kieu,Alatorre,Sewickley,PA,15143,USA,40.61214,-80.09791,450056013,Active,20000
210000,999989840,Randalllee,Mierzwinski,San Antonio,TX,78288,USA,29.53717,-98.57511,450058744,Active,50000
210001,999992774,Aliya,Cozza,Maple Grove,MN,55369,USA,45.11075,-93.42585,450057182,Active,31000

In [4]:
#Reads contents of a CSV file into a Pandas dataframe
# Any operation on a dataframe results in another dataframe
customer_df = pd.read_csv('C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\customer.csv')

# Print the type of a dataframe
# type(contact_df)
# type(contact_df.head(10))

# To get the top 10 rows of a df
# To store the resulting df, assign it to a variable
top10_customer_df=customer_df.head(10)
top10_customer_df.head()

# To get the bottom 10 rows
# customer_df.tail(10)

# Make a copy of a df
copy_customer_df=customer_df.copy()
copy_customer_df

,customer_id,customer_name,category
0,450056063,B.W.E CUSTOM CONSTRUCTION LLC,Insurance Company
1,450056064,SERGEY NIZHEGORODTSEV PUBLISHING LLC,Regional Company
2,450056066,SUNRISE ANDOVER LLC,Independent
3,450056067,474 CENTRAL BOULEVARD LLC,Bank
4,450056068,ELITE FINISHES LLC,Trading Platform Provider
...,...,...,...
3871,101040284,RT. 46 EMPIRE CORP.,Bank
3872,101040286,SALDANA CARPENTER & PAINTER INC,Independent
3873,101040289,A. BARBOSA TRANSPARENT CORPORATION LOSS PREVEN...,Insurance Company
3874,450059895,HNH TAXI SERVICES CO,Bank
3875,450059901,SHIFT Z INC.,Regional Company

In [5]:
#Reads contents of a CSV file into a Pandas dataframe
# Any operation on a dataframe results in another dataframe
txn_df = pd.read_csv('C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\txn.csv')

# Print the type of a dataframe
# type(txn_df)
# type(txn_df.head(10))

# To get the top 10 rows of a df
# To store the resulting df, assign it to a variable
#top10_txn_df=txn_df.head(10)
#top10_txn_df.head()

# To get the bottom 10 rows
# customer_df.tail(10)

# Make a copy of a df
copy_txn_df=txn_df.copy()
copy_txn_df

          txn_id    txn_date  contact_id ticker  txn_amount
0      422908498   2/25/2016   294382276  FSESX  1140739.21
1      422908499   8/31/2015   448325471  VIMAX   584829.06
2      422908500    3/6/2016   532659537  TEDIX   253000.41
3      422908501  10/21/2015   980973047  FESGX   450000.00
4      422908502   5/27/2015   508179324  POAGX   230000.00
...          ...         ...         ...    ...         ...
90005  423004161    3/6/2015   611395057  AEPGX    -5864.92
90006  423004162   8/20/2015   558411459  FFFDX    -7739.06
90007  423004163    9/3/2015   605064346  VPCCX    -8658.00
90008  423004164  10/27/2015   943870342  BALCX    -6552.20
90009  423004165   3/15/2016   221217324  VTHRX    -8352.83

[90010 rows x 5 columns]

In [6]:
#Reads contents of a CSV file into a Pandas dataframe
# Any operation on a dataframe results in another dataframe
product_df = pd.read_csv('C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\product.csv')

# Print the type of a dataframe
# type(product_df)
# type(product_df.head(10))

# To get the top 10 rows of a df
# To store the resulting df, assign it to a variable
#top10_product_df=product_df.head(10)
#top10_product_df.head()

# To get the bottom 10 rows
# product_df.tail(10)

# Make a copy of a df
copy_product_df=product_df.copy()
copy_product_df

,ticker,product_name,tna,ms_rating,exp_ratio,market_cap
0,VFIAX,Vanguard 500 Index Admiral,163456368456,5,0.05,Giant
1,VTSAX,Vanguard Total Stock Mkt Idx Adm,136131758268,4,0.05,Giant
2,VINIX,Vanguard Institutional Index I,110407917518,5,0.04,Giant
3,VTSMX,Vanguard Total Stock Mkt Idx Inv,98869371846,4,0.16,Giant
4,VIIIX,Vanguard Institutional Index Instl Pl,93192353649,5,0.02,Giant
...,...,...,...,...,...,...
421,ICPAX,Integrity Williston Bsn/Md-N Amer Stk A,552049374,4,1.45,Small
422,FLATX,Fidelity Latin America,517302920,2,1.13,Small
423,FSESX,Fidelity Select Energy Service Port,500675708,2,0.85,Small
424,FSNGX,Fidelity Select Natural Gas Portfolio,417197049,3,0.89,Small
425,GABUX,Gabelli Utilities AAA,398880321,3,1.39,Small

In [7]:
#Reads contents of a CSV file into a Pandas dataframe
# Any operation on a dataframe results in another dataframe
state_df = pd.read_csv('C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\state.csv')

# Print the type of a dataframe
# type(state_df)
# type(state_df.head(10))

# To get the top 10 rows of a df
# To store the resulting df, assign it to a variable
#top10_state_df=state_df.head(10)
#top10_state_df.head()

# To get the bottom 10 rows
# state_df.tail(10)

# Make a copy of a df
copy_state_df=state_df.copy()
copy_state_df

   state_code           state    region
0          AL         Alabama  Southern
1          AK          Alaska   Pacific
2          AZ         Arizona   Pacific
3          AR        Arkansas  Southern
4          CA      California   Pacific
5          CO        Colorado   Western
6          CT     Connecticut  Northern
7          DE        Delaware  Northern
8          FL         Florida  Southern
9          GA         Georgia  Southern
10         HI          Hawaii   Pacific
11         ID           Idaho   Western
12         IL        Illinois   Central
13         IN         Indiana   Central
14         IA            Iowa   Central
15         KS          Kansas   Western
16         KY        Kentucky   Central
17         LA       Louisiana  Southern
18         ME           Maine  Northern
19         MD        Maryland  Northern
20         MA   Massachusetts  Northern
21         MI        Michigan   Central
22         MN       Minnesota   Central
23         MS     Mississippi  Southern
24         MO        Missouri   Central
25         MT         Montana   Western
26         NE        Nebraska   Western
27         NV          Nevada   Pacific
28         NH   New Hampshire  Northern
29         NJ      New Jersey  Northern
30         NM      New Mexico   Western
31         NY        New York  Northern
32         NC  North Carolina  Southern
33         ND    North Dakota   Western
34         OH            Ohio   Central
35         OK        Oklahoma   Western
36         OR          Oregon   Pacific
37         PA    Pennsylvania  Northern
38         RI    Rhode Island  Northern
39         SC  South Carolina  Southern
40         SD    South Dakota   Western
41         TN       Tennessee  Southern
42         TX           Texas   Western
43         UT            Utah   Pacific
44         VT         Vermont  Northern
45         VA        Virginia  Southern
46         WA      Washington   Pacific
47         WV   West Virginia  Southern
48         WI       Wisconsin   Central
49         WY         Wyoming   Western

In [8]:
#Reads contents of a CSV file into a Pandas dataframe
# Any operation on a dataframe results in another dataframe
touch_df = pd.read_csv('C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\touch.csv')

# Print the type of a dataframe
# type(touch_df)
# type(touch_df.head(10))

# To get the top 10 rows of a df
# To store the resulting df, assign it to a variable
#top10_touch_df=touch_df.head(10)
#top10_touch_df.head()

# To get the bottom 10 rows
# touch_df.tail(10)

# Make a copy of a df
copy_touch_df=touch_df.copy()
copy_touch_df

          txn_id    txn_date  contact_id ticker touch_type
0      422905669   5/16/2015   109551310  FSUTX      Email
1      422905670   6/30/2015   222281598  HAINX       Call
2      422905671  12/29/2015   205629941  JAOSX      Email
3      422905672   1/18/2015   167576505  GSZIX       Call
4      422905673   1/26/2015   284418805  AKREX      Email
...          ...         ...         ...    ...        ...
16969  423012648   7/28/2015   942264810  FHAIX  Web Visit
16970  423012649    1/1/2016   515922781  VIFSX       Call
16971  423012650    9/2/2015   956817457  PTTDX       Call
16972  423012651   6/15/2015   187242525  VSIAX      Visit
16973  423012652   3/22/2016   251604270  SGIIX      Visit

[16974 rows x 5 columns]

In [9]:
# Describes the dataframe columns and their types
contact_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 210002 entries, 0 to 210001
Data columns (total 12 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   contact_id   210002 non-null  int64
 1   first_name   210002 non-null  object
 2   last_name    210002 non-null  object
 3   city         210002 non-null  object
 4   state_code   210002 non-null  object
 5   zip          210002 non-null  int64
 6   country      210002 non-null  object
 7   latitude     210002 non-null  float64
 8   longitude    210002 non-null  float64
 9   customer_id  210002 non-null  int64
 10  status       210002 non-null  object
 11  opportunity  210002 non-null  int64
dtypes: float64(2), int64(4), object(6)
memory usage: 19.2+ MB

In [8]:
product_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 426 entries, 0 to 425
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ticker        426 non-null    object
 1   product_name  426 non-null    object
 2   tna           426 non-null    int64
 3   ms_rating     426 non-null    int64
 4   exp_ratio     426 non-null    float64
 5   market_cap    426 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 20.1+ KB

In [14]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3876 entries, 0 to 3875
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    3876 non-null   int64
 1   customer_name  3876 non-null   object
 2   category       3876 non-null   object
dtypes: int64(1), object(2)
memory usage: 91.0+ KB

In [15]:
txn_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90010 entries, 0 to 90009
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   txn_id      90010 non-null  int64
 1   txn_date    90010 non-null  object
 2   contact_id  90010 non-null  int64
 3   ticker      90010 non-null  object
 4   txn_amount  90010 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.4+ MB

In [16]:
state_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   state_code  50 non-null     object
 1   state       50 non-null     object
 2   region      50 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB

In [17]:
touch_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16974 entries, 0 to 16973
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   txn_id      16974 non-null  int64
 1   txn_date    16974 non-null  object
 2   contact_id  16974 non-null  int64
 3   ticker      16974 non-null  object
 4   touch_type  16974 non-null  object
dtypes: int64(2), object(3)
memory usage: 663.2+ KB

In [21]:
contact_df.count()['contact_id']

210002

In [22]:
contact_df.sum()['opportunity']

20793654000

In [24]:
contact_df.head().sum()['opportunity']

391000

In [9]:
contact_df.describe()['zip']

count    210002.000000
mean      47191.148622
std       30182.214834
min           0.000000
25%       19610.000000
50%       45209.000000
75%       75240.000000
max       99901.000000
Name: zip, dtype: float64

In [11]:
contact_df.sort_values(by = 'last_name')

,contact_id,first_name,last_name,city,state_code,zip,country,latitude,longitude,customer_id,status,opportunity
4927,105552820,Leahbeth,Aabel,Salt Lake City,UT,84121,USA,40.63300,-111.80134,450058349,Active,69000
116536,429993790,Charters,Aabel,Paramus,NJ,7652,USA,40.94792,-74.06945,450058186,Active,20000
170487,696714494,Tk,Aabel,New York,NY,10016,USA,40.74633,-73.98246,450059202,Active,60000
80409,302001380,Wendy,Aabel,Missoula,MT,59802,USA,46.86927,-113.99445,450056400,Active,16000
83636,312733640,Tosin,Aaberg,San Diego,CA,92108,USA,32.77515,-117.12703,450056048,Active,26000
...,...,...,...,...,...,...,...,...,...,...,...,...
47055,200548207,Ranjeev,Zywan,Dubuque,IA,52002,USA,42.49937,-90.72145,450056391,Active,90000
123169,455286696,Mannathazath,Zywiciel,Philadelphia,PA,19103,USA,39.95319,-75.17497,450056563,Active,271000
105348,388548612,Yasmina,Zywicki,Charlotte,NC,28211,USA,35.14985,-80.82515,450057281,Active,50000
55246,224252172,Georgette,Zywien,Crystal Lake,IL,60014,USA,42.23196,-88.30639,450057989,Active,26000
1058,100962540,Mitshel,Zyzo,Walnut Creek,CA,94596,USA,37.88707,-122.02487,450058317,Active,50000

In [21]:
contact_df[15:20]

,contact_id,first_name,last_name,city,state_code,zip,country,latitude,longitude,customer_id,status,opportunity
15,100011383,Moss,Hepfer,New York,NY,10036,USA,40.76026,-73.99329,450057447,Active,150000
16,100011465,Candida,Vadino,Phoenix,AZ,85004,USA,33.47879,-112.07428,450056563,Active,80000
17,100013951,Johndavid,Runo,Boulder,CO,80302,USA,40.01691,-105.27889,450057018,Active,17000
18,100013965,Toochin,Unmatched,Fairfax,VA,22030,USA,38.85634,-77.33937,450059063,Active,70000
19,100014548,Dec,Dobkowski,Mandan,ND,58554,USA,46.80959,-100.83325,450059612,Active,20000

In [35]:
column_list=['contact_id','first_name','last_name']
contact_df[column_list].head()
contact_df[column_list][12:13]

    contact_id   first_name last_name
12   100010399  Bibekananda    Seltri

In [26]:
column_list=['contact_id','opportunity']
contact_df[column_list][12:20].sum()['opportunity']

580000

In [19]:
customer_df_raw = pd.read_csv('C:\\Users\\sanja\\Documents\\GitHub\\python_learning\\data\\customer.csv')
customer_df= customer_df_copy.set_index('customer_id')
#customer_df_copy = customer_df_copy.index('contact_id')
customer_df.head()

                                    customer_name                   category
customer_id
450056063           B.W.E CUSTOM CONSTRUCTION LLC          Insurance Company
450056064    SERGEY NIZHEGORODTSEV PUBLISHING LLC           Regional Company
450056066                     SUNRISE ANDOVER LLC                Independent
450056067               474 CENTRAL BOULEVARD LLC                       Bank
450056068                      ELITE FINISHES LLC  Trading Platform Provider

In [33]:
contact_df[contact_df['contact_id'] == 100000339]

,contact_id,first_name,last_name,city,state_code,zip,country,latitude,longitude,customer_id,status,opportunity
0,100000339,Lyndy,Chachas,Omaha,NE,68130,USA,41.22962,-96.1815,450058148,Active,50000

In [21]:
#filters market cap in given criteria
product_df[~product_df['market_cap'].isin(['Large','Small'])]

#filters market cap not in a given criteria
product_df[~product_df['market_cap'].isin(['Large','Small'])]

,ticker,product_name,tna,ms_rating,exp_ratio,market_cap
0,VFIAX,Vanguard 500 Index Admiral,163456368456,5,0.05,Giant
1,VTSAX,Vanguard Total Stock Mkt Idx Adm,136131758268,4,0.05,Giant
2,VINIX,Vanguard Institutional Index I,110407917518,5,0.04,Giant
3,VTSMX,Vanguard Total Stock Mkt Idx Inv,98869371846,4,0.16,Giant
4,VIIIX,Vanguard Institutional Index Instl Pl,93192353649,5,0.02,Giant
...,...,...,...,...,...,...
232,PTTDX,PIMCO Total Return D,5198345638,4,0.75,Mid
233,FMCSX,Fidelity Mid-Cap Stock,5160039708,4,0.73,Mid
234,TWCGX,American Century Growth Inv,5156163073,4,0.97,Mid
235,PCRIX,PIMCO Commodity Real Ret Strat Instl,5046315191,3,0.74,Mid
236,FDCAX,Fidelity Capital Appreciation,4999308754,3,0.83,Mid

In [26]:
#isna() to identify missing values. notna() is the reverse of it

product_df[product_df['market_cap'].isin(['Large','Small'])].isna()
#product_df[product_df['market_cap'].isin(['Large','Small'])].notna()

     ticker  product_name    tna  ms_rating  exp_ratio  market_cap
33    False         False  False      False      False       False
34    False         False  False      False      False       False
35    False         False  False      False      False       False
36    False         False  False      False      False       False
37    False         False  False      False      False       False
..      ...           ...    ...        ...        ...         ...
421   False         False  False      False      False       False
422   False         False  False      False      False       False
423   False         False  False      False      False       False
424   False         False  False      False      False       False
425   False         False  False      False      False       False

[266 rows x 6 columns]

In [36]:
txn_df1 = txn_df[0:5]
#txn_df1
type(txn_df1)

#txn_df1.head()

#txn_df2 = txn_df[6:10]
#txn_df3 = txn_df[11:15]

#txn_df123 = pd.concat(txn_df1,txn_df2,txn_df3)

pandas.core.frame.DataFrame

In [37]:
cc_df = pd.merge(contact_df,customer_df, on = 'customer_id')
cc_df.head()

,contact_id,first_name,last_name,city,state_code,zip,country,latitude,longitude,customer_id,status,opportunity,customer_name,category
0,100000339,Lyndy,Chachas,Omaha,NE,68130,USA,41.22962,-96.18150,450058148,Active,50000,ALL JERSEY LANDSCAPING INC,Regional Company
1,114071208,Nedal,Flaxel,Newton,MA,2462,USA,42.32690,-71.25398,450058148,Active,10000,ALL JERSEY LANDSCAPING INC,Regional Company
2,116683271,Palmer,Bannan,Yorba Linda,CA,92887,USA,33.89058,-117.76459,450058148,Active,30000,ALL JERSEY LANDSCAPING INC,Regional Company
3,150731263,Lauramin,Dossani,Williamsville,NY,14221,USA,42.96395,-78.73781,450058148,Active,163000,ALL JERSEY LANDSCAPING INC,Regional Company
4,166854907,Devrantna,Fedirchuk,Greenwich,CT,6830,USA,41.06702,-73.61830,450058148,Active,628000,ALL JERSEY LANDSCAPING INC,Regional Company

In [13]:
product_df1 = product_df.groupby(['market_cap']).sum()['tna']
product_df1.head()

market_cap
Giant    2118846030040
Large    1589202785334
Mid      1055859785300
Small     503792090129
Name: tna, dtype: int64

In [16]:
product_df1 = product_df.groupby(['market_cap','exp_ratio']).sum()['tna']
product_df1

market_cap  exp_ratio
Giant       0.02         131669331988
            0.04         178024316963
            0.05         354261113509
            0.06          69560710526
            0.10          36404019214
                             ...
Small       1.75           1319414307
            1.76           1154762675
            1.99           3238678589
            2.13            955062347
            2.14            830620145
Name: tna, Length: 248, dtype: int64

In [19]:
#joins 2 dfs on a the mentioned index
joint_df = contact_df.set_index('customer_id').join(customer_df.set_index('customer_id'), how = 'inner')

joint_df.head()

,contact_id,first_name,last_name,city,state_code,zip,country,latitude,longitude,status,opportunity,customer_name,category
customer_id,,,,,,,,,,,,,
101040146,100660470,Evian,Sheen-welch,Clarksville,TN,37043,USA,36.52131,-87.27582,Active,22000,MK MILLER CORP.,RIA
101040146,102213400,Butch,Garbarino,Cedar Rapids,IA,52401,USA,41.97792,-91.66773,Active,38000,MK MILLER CORP.,RIA
101040146,102603746,Asdrubal,Har-el,Troy,MI,48098,USA,42.59515,-83.17340,Active,80000,MK MILLER CORP.,RIA
101040146,120878287,Tingwei,Edele,Wilmington,MA,1887,USA,42.53993,-71.15070,Active,40000,MK MILLER CORP.,RIA
101040146,124628668,Jamesh,Grahn,New York,NY,10017,USA,40.75198,-73.96978,Active,184000,MK MILLER CORP.,RIA

In [22]:

joint_df = customer_df.set_index('customer_id').join(contact_df.set_index('customer_id'), how = 'left')

joint_df.count()

customer_name    210002
category         210002
contact_id       210002
first_name       210002
last_name        210002
city             210002
state_code       210002
zip              210002
country          210002
latitude         210002
longitude        210002
status           210002
opportunity      210002
dtype: int64

In [25]:
#not specifying how gives inner join
#Txn by ms_rating
txn_product_df = txn_df.set_index('ticker').join(product_df.set_index('ticker'))
txn_product_df.head()

txn_product_df1 = txn_product_df[['ms_rating','txn_amount']]
txn_product_df2 = txn_product_df1.groupby('ms_rating').sum()['txn_amount']
txn_product_df2.head()

ms_rating
1    2.948880e+07
2    9.837258e+07
3    3.330219e+08
4    4.844712e+08
5    2.599658e+08
Name: txn_amount, dtype: float64

In [10]:
#Contact Id based txns
txn_contact_df = txn_df.set_index('contact_id').join(contact_df.set_index('contact_id'))
txn_contact_df.head()

txn_contact_df1 = txn_contact_df['txn_amount']
txn_contact_df1.head()
#txn_contact_df2 = txn_contact_df1.groupby(txn_contact_df1.index).sum()
#txn_contact_df2.head()

contact_id
100008458     854.01
100008458    4182.78
100008458    3264.99
100008458     741.80
100008458    1485.66
Name: txn_amount, dtype: float64